[{"product_id":"B00TVKDW3C","text":"These things are fragile as hell. They are a bit small too.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Should've read more reviews. These glasses are absolute garage. I'm not really that picky when it comes to sunglasses but even for me these are crap. I guess it's a &#34;get what you pay for&#34; kinda thing.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"We're kinda small","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"As far as how dark the lenses are, they're great. Great style and color. When I got my set in the mail, the left ear piece hinge is in such a bind that it feels like it's going to break every time I go to fold them up. The right side is perfect, just the left side is messed up.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"not bad for the price if I loose them no problem","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"I would say i have a regular shaped head and these fit tight like they were for kids.....and they're NOT as dark as the picture.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Ok","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Great sunglasses I need to find a nice but kinda cheap aviator sunglasses this one works real we'll","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Worthless, cannot see through them, looks like your looking through smoke","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Glasses are too small, they look like children's wear. The part that is supposed to go over your ear, doesn't really reach.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Loved them at first, but then got horribly bent out of shape after a couple days","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"I guess they look good but are too dark to see out of.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Too dark and bad lens quality. It says polarized but I wonder. First they were sold for 10 dollar and now for 5.80. I really wonder if they are UV protected.<br \/>I am not a sunglass expert but it doesn't look like good quality lenses<br \/>Shape is fine and they look solid and are light.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"They are HUGE","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Clarity of lenses wasn't good.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"Save your money! The metal is very bendy. The lenses have a weird rainbow like stain across them easily visible in bright light.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"These do not have dark lenses and they are HUGE! I have a very round face and these won't even stay on my face. I'll have to see if I can modify them somehow just to wear them or return them... leaning towards the return since they're not even dark.","product_title":"Black & Gold Pilot Aviator Sunglasses"},{"product_id":"B00TVKDW3C","text":"way too small and too dark, I can't see anything out of them. I guess you get what you pay for, do not buy.","product_title":"Black & Gold Pilot Aviator Sunglasses"}]