[{"product_id":"B001UQ71G4","text":"The glasses came with the screws on the legs so loose they fall right off my face!!","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Good product. It is better than I expected.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"I ordered this New Wayfarer with black frame and G-15 glass. The product I received was the original product from Amazon. I compared it with the one I bought from Macy's. They matched exactly. However, quality of New Wayfarer is not great as expected from Rayban. It makes grinding noise in the hinge when I tried to wear it. Then I bought an original wayfarer from a local retailer. The quality of original wayfarer is way better than New wayfarer, however original wayfarer is heavier and pricier. I still chose the original wayfarer because of the build quality and returned the New wayfarer. I strongly suggest to go for the original wayfarer.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Not sure if these are real. My son has a real pair, and these are definitely of inferior quality","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Perfect fit and comfortable","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"I usually don't write reviews but I have NEVER been this disappointed from buying something off Amazon.  Upon arrival, the box and case all seemed genuine. Even the frame looked great and new. HOWEVER, upon holding it, the pair of glasses squeaked like no other!!! Not only that but the whole frame's quality was terrible. It felt like the hinges would snap or the lenses would pop out anytime. I am extremely disappointed because I thought Amazon would not sell fakes but I am wrong.  At first, I was a bit afraid of ordering because after reading many reviews, it seems some frames were fake and problematic, but I thought I would take a chance anyways since there were so many great reviews. (However, now I question whether these reviews came because the buyer never owned an authentic pair of Ray Bans before to compare..). But the hinges on this squeaks so much, and the entire frame seems like it can break any minute!  As I never owned a pair of Ray Bans and to make sure I wasn't delusional, I went to a Sunglasses Hut in my local mall to compare the frame in store to the one I received (exact model), and none of their frames had this problem. They all felt different- much stronger and better made!  Overall, I strongly STRONGLY recommend others to not buy Ray Bans from Amazon and instead go to a store and buy it :( I know it seems a lot cheaper here, but the difference in quality is worth it, and most importantly you won't waste time and money returning a fake product like I am &#62;:(.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Looks fake. I liked them in the beginning as they really protected my eyes from sunlight until I tried the exactly same model at sunglass hut. The model over there had much smoother finish and better quality frame material as compared to the one I got from amazon.  The amazon frame feels like cheap and low quality plastic which produces out click click sound while I'm wearing or removing them.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"I bought these a while ago to replace an older pair that I lost. Boy do I regret misplacing those! They were clearly better, with long-lasting, durable glass lenses. These new ones are great looking, lightweight and comfortable, but the plastic lenses are cheap, and vulnerable to scratches. If you're a little careless with your stuff, stay away from these. They won't hold up very long. On the other hand, if you handle these with care, like I do, they'll last a good, long time. The frames are super sturdy. But the lenses..? Not great.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Very upset when i recieved my order.  i got a pair of fake sunglasses.  from the moment i opened the package i knew they were knockoffs","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Not the real deal!","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Keeps the sun out","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"seems to be second handed. Don't know why...","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Look nice , little bit old fashioned so far si good. I'm not sure are they genuine.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"I ordered the new Wayfarers and received the original Wayfarers. The 55 is huge. I would recommend a 52 for females.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"I really wanted these sunglasses to be authentic ray bans but it was plainly obvious by the light cheap plastic that they were not. For 75$ your probably not getting italalian wayfayers. Instead your getting China wayfayers, they look exactly like the real thing but the plastic quality is lower and who knows what the lenses are made out of. If your going for knock off ray bans I'm sure there are cheaper ones out there than the amount you will pay here. If you check the description on Amazon it even says &#34;made in Italy or China&#34;","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Good. But there are some scratches on the frame.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"Life changing.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"},{"product_id":"B001UQ71G4","text":"This is my 4th pair ordered through Amazon, the first three pairs were order in 2012-2014 and were authentic but I lost them... This 4th pair was not authentic.","product_title":"Ray-Ban RB2132 New Wayfarer Non Polarized Sunglasses"}]