[{"product_id":"B001AQMLIC","text":"Pro's<br \/>Item feels great, fits my face perfectly,<br \/>i love this sun glasses,<br \/>their light weight<br \/><br \/>Con's<br \/>are expensive for being all plastic<br \/>do not have glass lenses, but that would add weight<br \/>they do not offer more lense option, the lenses on them have very light tint to them.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Small and way too narrow.  Go for the next size up, unless you have a small and narrow head.  I had to return these for this reason.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Absolute rubbish , im sure they are for juniors they are so small not the dimensions on the add. I do not need large sunglasses but these were so small. Not only that I live in Spain so I had to fill out a form for the customs to receive them. I have sent them back and I am waiting for a refund.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Very nice deal","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"These glasses are small!  They are better suited for a teenager than an adult.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"These classes are child's size which must be why they are priced so well.  It would have been nice if the write-up indicated as much.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Too small dude :((()","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Small very small. Kid size. For kids for Starz.  I have loved other ray bans in the past.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Great sunglasses but are small.<br \/>OK for early teen male not adult.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Good quality,  kind of small for a regular face. Good looking","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"I'm a Ray Ban fan, but I didn't like the frame material.  The tortoise frame I came across in a store was much nicer.  This model was recommended for those of us trying to replace our Ray Ban Cutters [now discontinued].  Maui Jim Punchbowl was a more comparable style\/fit.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"So these are NOT high quality sunglasses.  They are a courser mat finish, not glossy like the higher end Ray-Ban sunglasses.  But, for they price, not a terrible purchase.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"i should have payed a little more and ordered the ray-ban predator 2 rb 2027. you get what you pay for. i am happy with these sun glasses and so is my 15 year old son . i gave him the sun glasses, they fit him much better.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"No the quality was not what I expected...the lens are just ok, the frames are lightweight plastic there are no hinges they just snap together...,they feel & look cheap.  Looks like dollar store sunshades with Raban stamped on them.  The fit is small almost for a child.  Looks like the case is worth more than the eyeglasses...I own 3 pair raybans 2 pair I use for prescription eye ware.  This product does not compare.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"The frames are very small and flimsy. The glasses appear to be made for a child as they barely cover my eyes.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"Great for the price. The size and fit is a good fit for a small frame face.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"When I received the glasses they were actually much smaller than they appeared to be. The size of the glasses would have actually been more appropriate for my 8 year old.","product_title":"Ray-Ban RB4115 Sunglasses"},{"product_id":"B001AQMLIC","text":"I like it light look cool😎🎶🎸👍🏼","product_title":"Ray-Ban RB4115 Sunglasses"}]