[{"product_id":"B0032F0SF2","text":"they are a FAKE!!","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Ordered these last week....fake. Returned and ordered another pair....fake. Squeeky and not made of a single piece of acetate, you can feel the ridge where the frame was molded together as well as on the arms. I can't believe Amazon still endorses this. Garbage.  Update:  Just for fun, I ordered a third pair....and surprise surprise....Fake. Amazon has zero quality control. I don't think Luxottica would be happy with Amazon for giving all of their business to China.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"I wish I had more thumbs, so I could give these glasses 4 thumbs up","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Nice sunglasses. 100% Authentic. RB faintly engraved on the lens. Made in Italy on the ear piece. Came with black case, cleaning cloth and little booklet all wrapped in the retail Ray Ban box.  I went with the 55mm.  I have a huge head. I wear a size 8 baseball cap.  These fit my face well.  I love them so far.  My only complaint is the kind of creak and squeak when you put them on, or just open and close them. After some research online this seems to be normal for a lot of New Wayfarer owners.  Overall I am very satisfied with my purchase, especially the price.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"I've owned other polarized sunglasses before, but these are difficult on the eyes; there's simply way too much reflection and it compromises your depth of perception.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Bought these for my daughter. The 55mm is way too loose and the 52mm is too short and strange looking. They also squeak and feel very plasticy.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Good sunglasses but, no lie too expensive","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"these are fake.  in the top edge of the arms there is a metal seam from fake molds.  real do not have this.  metal hinges are not bolted on they are glued.  reals have a tilt to them fakes have less of a tilt.  the case and the lens logo and some other things were very convincing and hold up against most fake tests but after looking over everything.  these are 100% positively fake. if you don't care they are fake and just want some cool look a likes...  you can find them waaaay cheaper than this.  save your money","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Sorry to say but these are 100% Fake Ray-Bans.  I bought these exact sun glasses a year ago from Sun Glass Hut and paid $180.  Unfortunately, I lost them and decided to go on line.  When I saw them for $113 I thought I struck gold.  They're as light as a feather and cheap plastic all around, the lens are even plastic compared to glass on the real Ray-Bans.  If you don't mind having a fake and spending $113 than its a good purchase but if you're looking for the real thing and want quality this is not them.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"First pair ordered from the Prime sale were not authentic.  These WERE BOUGHT FROM AMAZON and not a third party seller.  The first red flag regarding the authenticity of the glasses was the inferior &#34;RB&#34; etching on the right lens.  It was done in such a manner that not only could you feel it, but you could also see it from 5-10 feet away as it looked like the lens was damaged (scratch, etc.).  Authentic &#34;RB&#34; etchings are nearly imperceptible and not something that can be easily seen from several feet away. The second, even larger red flag was the presence of a plastic seam on the top of the frame that was easily felt running across the entire length of the front of the sunglasses as well as down the top side of the arms.  Authentic Ray-Ban's are cut from a single piece of acetate, so there should be no seam on the frames (presence of seam suggests injection molding was used for creation). Everything else regarding the glasses seemed legitimate; eg, the case, cleaning cloth, and other features.<br \/><br \/>I submitted for a replacement, will see what I get in the next couple days.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Used them in the pool, on the beach and fishing.  They met all expectations for a great pair of sunglasses","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"great quality","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"The glasses came with scratched frames and dirty lenses. I don't know if they are authentic or not but the frames were creaking louder than my floors. Definitely returning them. Such a waste of time.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"I ordered four of these sunglasses for myself and my entire family (all polarized) directly from Amazon and not a third party seller. My first pair looked great but when I began to use them, I noticed they were somewhat flexible and had a noise every time I would handle them with my hands. To be honest, they felt like glasses you would buy at the dollar store, just somewhat more durable. My second and last pair did not feel like this, however. They were sturdy and did not make any noise at all when I flexed them. So long story short, 2 pairs I bought, felt like raybans. The other two feel like it was made for kids. Just to note, they all say their made in Italy. I guess I'll just keep them since their not bad but not great either. I have pairs I bought directly from their website and I just really believe that there has to be a big difference with the ones bought on Amazon versus the ones bought through their website.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"I have to give these a 4 star for the quality. Sadly they are fakes, I bought a pair and was pleasantly surprised at first box was good, not a glossy one but matte grey. And I took out the case and I was a little skeptical still, it comes with a good brown case, then I took the glasses out and that's when I thought they were real. But I told myself it's too good to be true. I spent about 2 hours watching videos telling the sighns of fakes ones and there were only three wrong things with this pair. First the engraving of RB on the left lense was able to be felt, it's suppose to be lasered into it so you can't feel it, but you can. Next, you are not able to see through them, with the real ones you can see the rough them and view the bar that goes though each arm, the fakes do have the arm, but you are not able to visibly see through them. Lastly, the angle of the front part. It's almost at a 85 degree angle where it should be a lot more. Thanks for reading my review.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"I just received the sunglasses and are fake. Cheap plastic and bad RB gravure. I do not recommend!!!","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"},{"product_id":"B0032F0SF2","text":"Broke after only having for 6 months. Amazon will not let me return items. Thought these were supposed to be high end sunglasses. VERY DISAPPOINTED with this purchase.","product_title":"Ray-Ban Man Made Wayfarer Sunglasses"}]