[{"text":"Update:<br \/>Just ordered a second pair (lost the first ones haha). Again, they're not my go-to sunglasses, but they're just fine for a backup pair, or a main pair for anyone that only wears sunglasses occasionally). I noticed some comments about the sizing.. They're definitely adult sunglasses, but I do agree that they're a little bit smaller than other sunglasses I own. My boyfriend borrowed them in the car the other day and they were pretty tight on him, but I imagine they would work for most adult women, as well as older kids and teens.<br \/><br \/>Original review:<br \/>Really like these. I wanted a backup pair of sunglasses to bring on vacation, and they look fairly similar to my $200 pair that are the same style and color. The quality is of course not the same, but they're just fine for the beach. The lenses are great—dark enough to provide plenty of protection, but still easy to see through (though the brownish red tint is a little on the strong side). They're good overall, and excellent for the price. I usually wear them any place I'm afraid I will lose my more expensive pair, and I definitely feel like I'm getting my $7 worth!"},{"text":"garbage"},{"text":"These arrived without a screw in one of the nose pads. Thumbs down."},{"text":"Sunglasses were bent"},{"text":"These were very chic as expected. Love them!"},{"text":"nice sunglasses"},{"text":"Just what I was looking for."},{"text":"They came crooked and scratched...I like them and they seem like fairly good quality but I was disappointed in the packaging (just a plastic sleeve) and the assembly (the nose pieces don't align properly). I would return them but I don't want to go through the hassle of shipping them back because they were only $5."},{"text":"didnt meet my expectations. lens was so shiny which wasn't mentioned in the description"},{"text":"Cheap so I was surprised to find out its quality is pretty good."},{"text":"These sunglasses are mainly just for looks. Nice looking but made cheap. You get what you pay for basicly."},{"text":"Cheap. Cricoid on the first day"},{"text":"These were a little bigger than I expected and unfortunatly the lens did scratch sooner than I would have liked. Overall it was a decent product for th price I paid."},{"text":"They fit a little wierd but you get what you pay for. Good lenses"},{"text":"Cheapo"},{"text":"really great product for a very reasonable price.  seem sturdy.  Used a beach with a hat and worked fine.  Graded so you can read."},{"text":"These shades look cool and the price is unbeatable, but you kind of get what you pay for. The frames fit me very snuggly so I would imagine if you had an even slightly larger head you would be in trouble. The worst part about the glasses are I found the metal nose rigdge to be quite sharp and stabby if it is positioned on your nose at a certain angle."},{"text":"I like it"},{"text":"Great quality for a cheap price! I'm getting another pair. :)"},{"text":"Classic pair of aviators"},{"text":"Don't get me wrong, these glasses look very decent to say the least; however, they broke the very first day I wore them- one of the legs snapped off when it was inside my bag... unless you're very careful, I'd suggest looking somewhere else."}]