[{"text":"This bag started falling apar from day 1... poorly made..nice design looks good but the material is inferior"},{"text":"Poor quality"},{"text":"Nice color!  It does not look like leather and looks a little cheap.  The straps are not located where it sits on your shoulder smoothly."},{"text":"Wasn't what I expected I guess you get what U pay for lol"},{"text":"I do like that this bag is very light and very roomy. It does have a smell to it that doesn't seem to go away. The straps are driving me a little crazy though because they always unbuckle."},{"text":"It's a decent sized tote and the color is pretty true. However the straps are buckle straps that come in buckled all the time. The tassel that comes on the zipper easily came off when trying to zip it close and then the zipper broke and came undone. If you don't mind sewing it back together and having the straps keep coming undone, this is for you. Otherwise, just use as it as an extra bag to throw things in. You really do get what you pay for."},{"text":"This product was defected the strap were sewed on wrong. I sent it back for a refund."},{"text":"I was excited until I put it to use just my wallet and car keys and the handle\/buckle came off.<br \/>not worth it."},{"text":"Great everyday bag,  especially for the cost.  It is not sturdily built so I suspect it will not last very long but a nice Summer Tote."},{"text":"I love it"},{"text":"I like it other than it puckers at top when all my stuff is in it. Not sewn together very well"},{"text":"I would say I love it, but the inside STINKS from the dye or the liner.  Almost an bug spray toxic smell!! But I hand washed the liner and that helped somewhat.  Love the bag tho - it's really cute.  Great for the money!"},{"text":"The smell of the material and\/or dye is so strong I'm not sure I can use the bag!"},{"text":"I love the look, but the quality is not as good as hoped.  Zipper broke on it after having it less than one month."},{"text":"You definitely get what you pay for.  Cheaply made."},{"text":"Retro fashion has never looked so bad. Got what I paid for? But a brown paper bag would honestly look more stylish. Edges were rough and showing foam. Truly not worth selling."},{"text":"I didn't really expect great quality for 10 dollars but the smell! It has been airing out for two days and I am afraid I will have to end up throwing it out. Never has anything smelled so bad!!!"},{"text":"To look at it, the bag is very cute!  However, it is of poor quality - even for the price.  The buckles do not hold the straps and the bag falls while in use. It can not handle much weight at all.  It would not have lasted two weeks."},{"text":"I bought this bag one month ago and the zipper has come out. Not at all pleased with the quality of this bag"},{"text":"Looks very cheap n handles r  cmg off"},{"text":"Love the color!  One of the leather handles was messed up and the zipper busted the first time I used it!!!"}]