[{"text":"Sharp edges need to be better polished."},{"text":"It's not a shoe...lol"},{"text":"Nice large shoe horn"},{"text":"No problems with product or vendor."},{"text":"good quality, easy to use"},{"text":"A simple yet elegant shoe horn. It does its job well:)"},{"text":"I bought this expecting it to work well. it has &#34;sharp&#34; edges. not enough to cut skin but I am sure it will soon leave cut marks in my socks. It does seem to work as I expected, i just expected a smoother more professional product. More time could have been taken to remove punch tabs and burrs."},{"text":"None of the questions apply to a shoe horn, but it works great!"},{"text":"I think a couple inches longer would be a better size for males"},{"text":"arrived as described, met expectation"},{"text":"Product arrived quickly & as described."},{"text":"Perfect shoe horn. Sturdy and helped me get my boots on."},{"text":"Simple & effective.  There were no sharp edges or burrs & the quality is as good as I expected."},{"text":"Does the job. Would buy again."},{"text":"It's a shoe horn, not a pair of shoes so the above questions don't apply. I couldn't find a sturdy 6&#34; shoe horn so I bought this one and cut off 1 1\/2&#34;. It's works and fits in my car console. If you need a short shoe horn don't buy a plastic one or cheap steel one."},{"text":"The edges are sharp. Cut me finger. Unacceptable. Who get injured using a shoehorn?  Update:  the seller emailed me, gave me credit and send me a new one. Thank you!!!"},{"text":"I normally only write reviews when something is great or really sucks... this production is an exception due to what it is made for. The job is done well with it. I have no yet tried it but I can already tell it will do the job as expected (Especially since it is not plastic).<br \/><br \/>But the one star is due to the fact that this &#34;brand new&#34; item looks like it has been around the block. Came in a plastic bag which was clearly something that was placed and shut with tape by a human (not machine clean) and when I opened it I realized that the logo is faded and there are at least 15 scratches on it. By scratches I do mean I can run my finger nail over them and feel the &#34;bumps&#34;.<br \/><br \/>I feel like this thing was used for a few months then returned and sold to me as new. This is the very first item I have bought which I feel the need to sterilize due to its conditioned look.<br \/><br \/>Great product, very sturdy, but when you are going to sell a new item, make sure it looks and feels new."},{"text":"A little larger than I expected. Works fine, though."},{"text":"IT DEFINITELY MEETS MY NEEDS.  I DEBATED ABOUT ORDERING THIS OVER A LONGER SHOE HORN BUT I'M VERY GLAD I MADE THE CHOICE I DID.  THE SHOE HORN IS METAL (HARD TO FIND IT SEEMS) AND MEETS MY NEEDS VERY WELL."},{"text":"Shoe horn works nicely. Helps to get your shoes on with ease..."}]