[{"text":"I don't like it at all! I think it's very poorly made!"},{"text":"The strap broke off after only one use!"},{"text":"Oh my God I order this bag on Thursday I get it on Saturday but I used it on Sunday n Monday  day it's broken already huhuhuhuhu"},{"text":"trash!!<br \/>it's fake! i need my moeny 's back!!"},{"text":"strap broke with only a wallet and cell phone in it only used once didn't even make it out the door with out strap breaking"},{"text":"Tore up on my Hawaii vacation,  too cheap"},{"text":"I ordered two of them Unfortunately. I used first day all chains broke I fixed but not good quality I want to return them."},{"text":"This tote is not a good buy. I was very disappointed. The material was very cheap. I thought I would be able to take it on my Trip but I had to purchase a good quality tote. One that I would feel safe carrying"},{"text":"Doesn't look at all like the pic.  Don't bother!"},{"text":"I wanted so badly to write a nice review about this bag. First of all, it is cute!  It was the perfect bag for a summer tote.  We live in a rural area where we often take day trips into town and like to &#34;get away&#34; for a few hours.  I take my snack, cosmetics, sweater, cell phone, meds, a bottle of water, sun screen etc.  This purse held it all until, 2 weeks after I bought it, the dang strap broke!  (see pic.) I wrote to the company and they said to get a refund, I would have to actually mail the purse back to them along with an actual PICTURE of the broken strap!!! That doesn't make sense!  All that trouble for a $7 purse??? Oh well, I learned my lesson.  I'm saving my money for a nice Guess tote some day at an outlet store.  If you're wise, you'll do the same!"},{"text":"This purse is a piece of crap!  It does not stand up on a flat bottom.  It is just tacky.  I will dump it in the goodwill box asap.  I have learned a lesson, no free lunch!"},{"text":"handle broke within 1st week of use and I wasn't carrying anything beyond a wallet, phone, and a few other small items"},{"text":"I was so excited when I received this bag... I had already had it picked out what lucky wardrobe I was going to promote this bag with.<br \/><br \/>When it finally arrived, I had it down to the count that I would transfer my belongings from my current purse, & be on my way!<br \/><br \/>When I completed my goal, I went out in public with the confidence that my bag, my wardrobe would set the scene, & Immediately when I walked across the street, the new bag of purchase &#34;Broke&#34;!  (Doom, Doom, Doom)...<br \/><br \/>The handles where the chains are connected popped... I immediately picked up the remnants, & was saddened by the ordeal.<br \/><br \/>Ok, so never fail, a woman has to do, what a woman has to do..., &#34;Repair&#34; it the homemade old fashioned way.<br \/><br \/>Take out the hot glue gun, & secure the straps, so no more faulty disruptions.  When all else fails, they broke again. (Ugh!)<br \/><br \/>Now this purse has become a catch all underneath my desk @ work, needingly to say, that the bag broke on the street near my work.<br \/><br \/>I had high hopes, & high expectations when this bag was going to arrive.  Non the less, it hasn't gone completely Hopeless, it just remains underneath my desk @ work, to put nick nacks in ( primarily utilized as storage) for its usage.<br \/><br \/>Oh, well, the world isn't over..., I ended up buying another bag, not quite like this one.  The color is what I was attracted to when I made this purchase.<br \/><br \/>For the price, I presume, 'You Get What You Pay For!&#34;<br \/><br \/>V"},{"text":"This bag looks great. The metal that makes the chain links on the handles is pretty thin, so I cannot fill this bag with heavy items."},{"text":"Terrible please don't purchase. You will be very disappointed! Nothing like the pics! This is a real person telling u to not waste ur money!"},{"text":"Very cheaply made. The chain broke the first day I got it...would never order from this site again!!!"},{"text":"i just waste money for this... sorry:("},{"text":"Price is cheap for a reason.  Cheap quality, weakly handles.  Do not recommend."},{"text":"The purse is canvas - which I like .  It is functional and serves a purpose.  It is not made of the highest quality; however from afar it looks as if it is"},{"text":"It was a very poor quality fabric. The links are not sturdy and the strap broke on the first day. I am very unhappy with the product."},{"text":"Super cheap looking straps and trimming!!!!"},{"text":"NO WAY!  Very bad use of your money.  Purse hand;es very wear andfragile. If you put anything in the purse that weights ,more than 2 pounds.....BEWARE.  Not a good buy.  Company refunded some of the cost but not the full 100%"},{"text":"Strap broke almost right away"},{"text":"Cheap looking  well you get what you pay for"},{"text":"I'm so very disappointed with this bag, very cheaply and low quality!<br \/>Just wasting money for buying it!"},{"text":"The bag straps broke the first day I used it (even though there were no heavy contents in it). By the second day, the inner zippers broke."},{"text":"the chain broke immediately and I didn't put anything in the bag yet"},{"text":"Really I just wanted an everyday work bag that I just didn't want to spend a fortune on. Quality is ok on account of the price. And lets be honest, it is super cute! Update: Not worth it, had to give it a star because the system doesn't allow you not to. It popped after my second time using it. I got my money back though"}]