[{"text":"I was really disappointed when I got it and saw what it really looked like.  After a week of use it started to fall apart.  Not a good choice on my part."},{"text":"But feel quality is not good and it is said to be leather but when touched, it feels not like leather."},{"text":"Bigger than forecasted for trouser pockets but useable."},{"text":"Actually, I would have preferred to have the clear plastics sleeves like the ones that are in my old wallet. Hopefully I'll find a use for it though. It looks nice and appears to be made well."},{"text":"Too bulky and coins keep falling out."},{"text":"What I wanted and more, love it"},{"text":"just what I needed"},{"text":"This is pretty fat, about 2x fatter than the wallet I was trying to replace.  Won't fit in a pocket, so not much use to me."},{"text":"Way too small...description is a little misleading.  I returned it."},{"text":"Performing as nicely as my previous one. Like the security feature."},{"text":"Could have been a little larger in size to accomidate money better.."},{"text":"Neat product.  I and several other family members own it in various colors.  I recommend this product."},{"text":"Too small"},{"text":"No room for extras that don't fit nicely into a pocket.  I returned it."},{"text":"It seemed perfect at first.  However, to keep the zipper tong from poking me I would tuck it under.  One time when fishing the zipper out it got pushed in and fell right off the track and now the wallet is useless.  It's a bad design to have a zipper that is not capped at the end so the mechanism doesn't fall off.  Now I'm in search of  similar one.  Hopefully it will last more than the 4 weeks I had this one."},{"text":"Has a large capacity for cards is easy to get into. Doesn't take up a lot of room in your purse."},{"text":"Absolutely Love this credit card wallet.  Soft,  holds a lot of credit cards and I really Recommend this credit card\/wallet."},{"text":"Feels good to have this added protection, there is no place to add dollars without having to fold the money. Still using my old wallet for store reward cards and dollars."},{"text":"I like the wallet very much.  I feel safer."},{"text":"It is a little too large even for my purse."},{"text":"The size of this wallet is what I was looking for. It holds credit cards, ID, and has a compartment you can use for money."}]