[{"text":"I read so many reviews saying these were fitting people smaller than expected so I ordered a size 11 since I'm 10.5 (and 10.5 wasn't even an option). They're huge, floppy, clown sandals. Do not order a size large! This is the first product I've had to return."},{"text":"This was my second pair of Reef Men's Phantoms sandals.  The first pair needed to be replaced after I lost one sandal at Havasupai.  The sandals were great for about 3 years.  So, I bought the same brand, style, and size, expecting the same.  I was disappointed.  The sandals were worn inside for one month.  The first time I wore them outdoors, at Lake Powell, both sandals separated.  I no longer wear these sandals.<br \/><br \/>The first pair I rate 4 1\/2 stars.  This pair I rate 1 star."},{"text":"Owned these sandals for two months and the bottom has already separated from the sandal. The fake leather straps have also started peeling."},{"text":"I like them - but they're not the best for extended wear.  The area around the toe strap tends to rub and the inner fabric is fairly abrasive.  Am sure my skin will adjust - but I prefer sandals with a soft fabric wrap around the toe strap."},{"text":"I've worn these only inside the house and they are already falling apart after a few weeks. The straps are frayed and the sole on one sandal just started to separate. I've bought $5 sandals at Rite Aid that last longer than these. I am happily returning them."},{"text":"They are nice, just a bit narrow and probably need to get a size bigger than your norm."},{"text":"I've owned these for less than two months. They're uncomfortable, the outside of the strap is cracking and ugly, and the sole came unglued. I would not recommend these sandals to anyone. Take a look at the pictures and see for yourself."},{"text":"Both these sandals split within hours of their first use in the sun. Clearly they are not real Reef sandals. Avoid this seller of they are selling knockoffs!"},{"text":"Just got my Reefs today...On Sunday believe it or not. They started Sunday delivery out here in the sticks of central Illinois. GO AMAZON !!!<br \/><br \/>These sandals are very comfortable and decently priced. It is always a gamble buying shoes or sandals-flip-flops online. I wear a 10 1\/2 and ordered an 11. They fit perfectly with no room to spare. If I were to order them again I would order an 11 1\/2. The heel of my foot does not overhang the sandal but it is very close. I would say my heel is exactly even with the back of the sandal. I wear a wide shoe more because of aged joints than necessarily a wide foot. There is no room to spare on the width either. I did not see any way to order a wider flip-flop from them though. The arch support seems very good and they were comfortable the first time I put them on. Initially they did not seem to be very grippy.  They were kind of slippery on my linoleum floor. but after an hour or so of wearing them they started to grip the ground better. They are very lightweight, look good, and appear to be well made. All in all I would buy them again. Just note that you must order a full size bigger than your normal size, and they probably will not fit a person with a wide foot."},{"text":"I had what I thought was the same exact pair that I bought from a local retail store, I had them for years and loved them so when I saw such a great price on Amazon I decided to order. While they appear to be the same they are not as comfortable and are smaller in size."},{"text":"I guess the only thing I see wrong is the size.  These were unproportionally small.  I wear 11 sneakers and sometimes need smaller flip flops or bowling shoes but I'll need a12 in these.  It might be worth reevaluating the size chart.<br \/>Quick and easy ordering and delivery, fairly priced.  Exchange process inconvenient but they probably always are with online shopping."},{"text":"Ok quality but the sz 11 ran a tad too small for me. I generally wear an 11.5 but sometimes an 11, depending on brand."},{"text":"Very nice sandals."}]