[{"text":"One of the lenses popped out after around a week of use. I was able to pop it back in but there's a little bit of a gap. This doesn't inspire much confidence in the quality of the construction.<br \/><br \/>The lenses also tend to get cloudy pretty easily and cleaning them with e.g. my t-shirt doesn't work as well as with other sunglasses. These do come with a lens cloth which I haven't tried so I suppose it's possible it would work better with that. It's inconvenient to have to carry that around though.<br \/><br \/>The nose bridge also rests a little lower on my face than I'd like. If I'm doing something active (e.g. running or biking) while wearing these, they will slide down my face so some of my view isn't covered by the glasses. That's probably my fault for not going out to a store and trying these on for fit though."},{"text":"Nice glasses, a little pricey for what they are, but the lenses are glass."},{"text":"great sunglasses, it's original Ray Ban, made in Italy, great lenses and medium darkness, exactly what I wanted, I love it."},{"text":"NOTE: Original purchase NOT from Amazon, however, these are the best glasses I've ever owned.<br \/>I have worn the same pair of polarized Predator 2 glasses exclusively for more than ten years straight---same single pair of glasses.That should tell you something about the quality of the glass, frames, and hardware. I recommend you also get a pair of Croakies or Chums and hang these shades around your neck when you're not wearing them and yours can last that long as well. That way you're less likely to set them down somewhere and have them disappear. Also hang from my rearview mirror when not in use or hanging around my neck. AlI of these things have helped me to neither lose nor sit upon them.<br \/>I work in HVAC industry and these glasses have stood the test of time and abuse, and they are great on a bright, hot roof. The lenses only just began showing minor scratches after about the first 7-8 years.<br \/>I have only worn Ray Bans with glass lenses because they provide a clear and true picture and don't distort vision. I find that my vision becomes distorted if I wear cheap glasses with cruddy polycarbonate lenses. There may be some manufacturer out there with decent poly lenses, but I've not yet found one which I like.<br \/>I will soon purchase these again, and I will most likely be purchasing these from Amazon, as the price is slightly lower than what I paid retail at &#34;Sungla$$es Hut&#34; ten long years ago."},{"text":"I never cared for expensive sunglasses because I am always loosing them but I tried one of my friends Ray-Ban (polarized) and love them so much that I had to get my self a pair. I settled for this model and loved them. You are able to see things with them on that you are not with the naked eye. I drove through long tunnels in the dark and didn't have to take them off, driving through sun rise\/set with these on is wonderful because you are still able to see without having to squint your eyes or pull down the sun shade. I would strongly recommend these sunglasses to someone who is in the sun a lot."},{"text":"was what it said. True Ray Bans good cost and fast shipping."},{"text":"Excellent product"},{"text":"Nice pair of glasses, but it doesn't clamp as hard as most other glasses of the same size when worn temporarily on the head above the eyes. It keeps slipping off and has also fallen completely off once."},{"text":"The product I wanted at a fair price. Timely service! No complaints :)"},{"text":"UPDATE 2: Finally got response after posting to Luxottica's Facebook site wall. Eventually mailed new glasses and charged $25 handling fee--- feel like I had to twist their arm to do the right thing, so upgraded 1-star-- End of the day, not worth the 8 months it took to get this issue resolved.  UPDATED: Within warranty period, a small hairline crack emerged from within one of the lenses. The lens seemed intact except for the very fine crack. This took place with normal use during a cold winter day while outdoors-- glasses have never been dropped. I've had several Ray Ban glasses over the years with no issues until now (most were lost while boating etc). Contacted Luxottica which refused to honor repair alleging it was not a manufacturing defect. Customer requested additional review which after 4 months came back with same result. Luxottica sent a letter offering to repair for $70, but I have been unable to reach Warranty service at 800-343-5594 despite repeated attempts over the past 2 months (now totaling 6 months of effort to resolve this!). Emails initially took weeks to receive response, but in recent weeks I no longer receive any response (consumerwarranty@mailmw.custhelp.com). Filed BBB complaint for lack of compliance with terms of the Warranty and poor customer service (an unheard of for Ray Ban) support. At this point I've lost hope in getting my sunglasses (even in its current condition) back.  Best sunglasses ever, great for motorcycle riding with the Polarized glass lenses-- won't scratch or break"},{"text":"Lens too big also the lenses are slightly mirrored. Not what my husband was looking for"}]