[{"text":"I bought a pair of these boots in early 2012 from a local vendor....so this is a post-three year review. They were the black leather ones.  I've worn them through several Boston winters and the uppers held up perfectly fine as long as you take care of them....salt in particular will mess up leather...even the nicest of leathers....so some care\/upkeep is needed on these...but again that goes for all nice things. The only real (minor) issue with the leather is that the dye is not very deep...minor scrapes on black (or I imagine other off-natural colors) immediately shows and only shoe polish of the right color takes care of it.<br \/><br \/>The laces that shipped with broke after a year, so I replaced them with more durable ones.  Meh no biggie.<br \/><br \/>The original heel was junk and wore out exceedingly quick....this is sort of expected since I walk five miles a day or so routinely on concrete, but was still sorta weird how quick it went....I had it replaced at the four month mark. What was a bit more disappointing was that the outsole went bad really quickly.  In particular the outsole on these did not do well with any sort of moisture...be it from a rainy fall\/spring or winter.  Now I know these are &#34;dress boots&#34;, but all it took was a few rainy days of walking into work on concrete to cause legit wear to the outsole... (and yes I do dry my boots every night after I wear them...)Thankfully I monitored this and then went and got rubber outsoles put on the boots after the first six months.  They look fine...better I'd say actually and have been far more durable....basically they've lasted ~3 times as long as the original outsole...same with the second heel I got...although I'll need to be replacing that again soon too.<br \/><br \/>The uppers on these have been fantastic and have broken in very nicely...no complaints there.  I have probably walked 1000 miles in these things, albeit with different heels and outsoles based on what they shipped with.  I am considering getting another pair in a different color, but I just wish they'd ship these things with a more practical heel and outsole rather than keep the ones that are on now. I'd even bet the things would be slightly cheaper since you'd be using rubber rather than whatever leather\/stuff they use now.  This is the one thing preventing me from just buying another one....it'll cost ~$60 to refit these boots once I get them with a heel and outsole that will last and at that point I might as well just be shopping for a slightly better pair.<br \/><br \/>Oh well.ering getting another pair in a different color, but I just wish they'd ship these things with a more practical heel and outsole rather than keep the ones that are on now. I'd even bet the things would be slightly cheaper since you'd be using rubber rather than whatever leather\/stuff they use now.  This is the one thing preventing me from just buying another one....it'll cost ~$60 to refit these boots once I get them with a heel and outsole that will last and at that point I might as well just be shopping for a slightly better pair.<br \/><br \/>Oh well."},{"text":"Bought the boots 2 weeks ago.  I oiled them and waxed them.  Wore them in the rain for the first time and the (rubber?) bottom layer of the heel separated from the rest of the heel.  The cobbler explained that the heel is made of compressed cardboard (not leather or strong synthetic material) and there was no adhesive holding the layer that separated.  He glued it, put in extra nails on both boots, and applied a &#34;military&#34; sealant.<br \/><br \/>Otherwise, I do like the style and the leather uppers, so when the store where I bought them offered to take them back or cover the cost of the repair, I went with the latter.<br \/><br \/>From the other yelp reviews, it looks like these boots have an issue of poor quality materials used for the soles or (in my case) heels.  Shame on Woverine for using cheap materials (and not made in USA) on an &#34;original&#34; product."}]