[{"text":"I guess I am too naive about women's shoes. After spending hours in a shoe warehouse looking for ANY cross-trainers in wide widths and leaving with no options, I did some research online, then came to Amazon where I spent even more hours reading reviews. I purchased four pairs of cross-trainers and not a single one worked. Learn from my mistakes.<br \/><br \/>As a reference, my bigger foot (left) is 9.5&#34; from big toe to heel, the ball is the widest part of my foot at just over 4&#34; and my heel is 2.5&#34; wide. I typically wear a size 7.5. I have a bunion on my left foot, very high arches, and my pinkie toes are a bit hammertoed from years in ill fitting high heels. I am making a concerted effort to wear better shoes, even if it costs me more. Unfortunately shoemakers refuse to recognize women with foot widths over 3&#34;. I ordered all these shoes in 7.5 D because I didn't see them any wider. That may have changed by the time you are reading this. Zappos tells me I should have ordered a size 8. Take my review for what it is: my one-time opinion.<br \/><br \/>Pair 1: NB 797 7.5 D. As I took these out of the box I knew they were doomed. Seriously, these don't look like &#34;wide&#34; shoes at all, I wish I'd gotten the &#34;normal&#34; B width to compare. This must be a joke, right? After putting them on I noticed what is a constant problem for me. The toe box of the shoe is too narrow, while the heel\/opening is gargantuan. Pinkie toes are pinched and bunion is sensitive. Length is also cutting it close, like half a thumb left up front. Seems low on the sides but that's probably for the lateral movement. Also, the insole seems to be floating in the shoe. It's not too narrow, it's just not glued down so it seems like it might keep coming out every time I take the shoe on and off.<br \/><br \/>Pair 2: NB 711 7.5 D. These are the cutest in my opinion. I seriously want these to work. But they look so narrow. What. the. heck. Ah, super lightweight, not a lot of seams, narrower heel for sure. Also less padded around the shoe opening than #1. After leaving it on for just a few minutes, my bunion is throbbing slightly. That does not bode well. Length is cutting it close. If this came in an 8 4E, it would be a keeper.<br \/><br \/>Pair 3: NB 20 Minimus 7.5 D. These are definitely the least appealing to me. I mean they aren't bright white, but not my cup of tea. Anyway. Definitely the widest of the bunch. Ample room on the outside of the foot, it's weird, they sort of lean in, in a way that makes my bunion feel the bottom seam of the shoe. So it's not the pressure from the top or side that is irritating it, it's the lip of the shoe insert. Oh, there's no insert. Well I guess just where the upper and lower parts of the shoe meet. Looking at it you would be able to tell what I'm talking about; it definitely leans. The sides and back come up a little higher on the ankle, still not above the outer fibula bone-end, or the interior navicular bone-bump, so I like it more. I'm also clearly a dum-dum for ordering a 7.5. Still, this feels the best so far except for lean and it's effect on my bunion. Is the lean important to &#34;minimal&#34; shoes? Also, the box mentions running, which is not what I'm interested in. The listing online says cross-trainer.<br \/><br \/>Pair 4: Asics Gel Unifire 7.5 D. These are also a joke. The leather detail work on the uppers irritate my bunion from the start. The toe box is too narrow for the rest of my digits too. Actually the length on this seems better, but that is the only thing that is okay with this shoe. It feels nicely padded, I'll give it that. A big nope, all in all.<br \/><br \/>So all four of these go back, what a delight. This isn't a waste of my money and time at all, nooooo. I have now ordered NB Mens 623s and 608 in both 2E and 4E. I've also ordered from Zappos the Asics Gel 180 in 2E for women and the Asics Gel Acclaim in 2E for men. I think the biggest problem is Amazon's lack of selection (not even color-wise, just pure options!) at wide widths, and potentially no standardization of sizes, just like clothes. Are wide shoes just the unicorn of footwear or does Amazon just not care?"}]