[{"text":"This is Susan's son, first off; the shoes were purchased for me, so I felt it made sense for me to write the review. And, as a bit of a forewarning, I'm in the process of sending these back as I type this review because these shoes just did not work for me at all.<br \/><br \/>I found these in a local shoe store and really liked them when I tried them on, particularly the lightweight feel, but they didn't have a size that fit well, so we bought them on Amazon a half-size up later that day. They arrived August 12 and I've worn them repeatedly in the three days since. However, after wearing them and being on my feet for a few hours at a time, I've come to the conclusion that these shoes would only work for a relatively small niche of people; that is, people with narrow feet who live in cooler climates.<br \/><br \/>Below the mesh upper is another, relatively thick layer of fabric that negates any breathability the mesh upper might confer to the foot; add to this the synthetic covering of the memory foam insole and you have a recipe for a shoe that retains heat very well. While this may be a blessing in colder weather, in Texas heat, it's a veritable nightmare for your feet as, after less than an hour, your feet will be hot and sweaty and you'll be wanting to remove the shoes with all haste.<br \/><br \/>Normally, I love Skechers' memory foam insole, as my Avillos have it and I wore those until the insole started coming apart at the seams and flaking off (I got a good several years' use out of them, so I'd say I got my money's worth; they're still functional even now), but with the way the insole is designed on these Persistents, if you have anything but a very narrow foot or tend to walk on the outer edge of your foot, the memory foam insole might as well be nonexistent. I took a measurement and, at the arch of the foot on a size 11, the insole measures a measly 2 inches in width; for comparison, my own foot at the same spot is 3.5 inches wide. Granted, I have a wide foot, so that's not the best comparison, but I've generally found with Skechers that I can reliably go up a half-size if a wide is not available (and it wasn't in these in the color we bought) and be perfectly comfortable. Not so this time. I found the inside half of my foot was resting off the edge of the insole, which was not the most comfortable experience.<br \/><br \/>Nevertheless, these shoes DO have some good points. I said this shoe was a good concept with a less than stellar execution and I meant it. The idea of a lightweight, flexible, and casual slip-on shoe that you could wear with most anything is a very attractive one and in those respects, it actually succeeds. Skechers states on their website that a Men's 9 weighs about 6 or 7.5oz (I can't remember exactly) and I wouldn't be surprised if the 11 weighed more than 8-9oz; they are very flexible and the upper has a good amount of give that I've only found surpassed by Converse All-Stars High Tops. And they are also casual, looking good with shorts or jeans or cargo pants, though whether or not they would actually go with anything is dependent on color (the black or charcoal, I think, would work with just about any outfit, the latter especially).<br \/><br \/>However, because of the shortcomings of the stifling upper and the too narrow insole, the places you actually want a shoe to succeed (particularly a walking shoe), these fall far short of what I was hoping for them to be.so that's not the best comparison, but I've generally found with Skechers that I can reliably go up a half-size if a wide is not available (and it wasn't in these in the color we bought) and be perfectly comfortable. Not so this time. I found the inside half of my foot was resting off the edge of the insole, which was not the most comfortable experience.<br \/><br \/>Nevertheless, these shoes DO have some good points. I said this shoe was a good concept with a less than stellar execution and I meant it. The idea of a lightweight, flexible, and casual slip-on shoe that you could wear with most anything is a very attractive one and in those respects, it actually succeeds. Skechers states on their website that a Men's 9 weighs about 6 or 7.5oz (I can't remember exactly) and I wouldn't be surprised if the 11 weighed more than 8-9oz; they are very flexible and the upper has a good amount of give that I've only found surpassed by Converse All-Stars High Tops. And they are also casual, looking good with shorts or jeans or cargo pants, though whether or not they would actually go with anything is dependent on color (the black or charcoal, I think, would work with just about any outfit, the latter especially).<br \/><br \/>However, because of the shortcomings of the stifling upper and the too narrow insole, the places you actually want a shoe to succeed (particularly a walking shoe), these fall far short of what I was hoping for them to be."}]