[{"text":"My perspective: I am a long distance runner. I run from 4-25 miles so the amount of miles daily can vary. I have had some challenges with injuries over the last year as well starting with metatarsal bone bruising and ended up now with a MCL Sprain and Pes Anserinus tendinitis. I spend a lot of time looking for the right shoes. I have both the NB Vazee Pace and the Vazee Rush. Of the two I prefer the Rush (though many of my runner friends prefer to Pace).<br \/><br \/>This shoe is built on the same last as the New Balance Zante which means it has a fairly snug midfoot and a decent size toe box. It has more toe box height for me then the Zante and more than the Pace. The overlays are structured in such a way as they don't hit any of my hot spots. The cushioning is New Balance RevLite (I think) and this is a much firmer material that has good energy return and spring. However it is NOT mushy\/cushy or like walking on clouds. The heel\/toe drop is 6mm which is middle of the line. The toe is upturned which does give you a feeling of springing forward. I find this shoe very comfortable to run in and can do long distances. It doesn't have a ton of support - however it's not a minimal shoe. The heel, in particular, is not super structured nor does it have hard plastic in it - this is music to my achilles which often react to other shoes with very plastic\/hard heel counters. These do stretch a bit but like any running shoe you should not need to break them in. The vast huge majority of people I see buying running shoes are buying them WAY TOO SMALL. I cannot tell you how many people I see complain and I can SEE the tip of their toe is practically coming out the front. You should have at least one fingers width from the top of your longest toe to the tip of the shoe - and if you go long distances you can often desire even a bit more. I think it's vanity that people insist they wear a X size shoe. I've seen feet so stuffed into shoes it looks like they are have rolled sausages and one hit will cause them all the flesh to pop out like those old biscuit packages! Stop buying shoes too small folks. Who cares what the size is. My size in these is 1 full size larger then many of my street shoes but about normal for me in running shoes. I wear a 6.5M or 6.5W and sometimes a 7M normally in flat's or heels. I bought these in 7.5M and they are just fine. If you have a foot that usually fits a M then just make sure you are sized appropriately. If your foot tends to run wider (but not so wide you always buy wide shoes) then make sure you go up at least a 1\/2 size...or buy the wide 1\/2 size longer. These are consistent with my other shoes for length but they are a bit pointy so take that into consideration.<br \/><br \/>If you are someone who wants cushy marshmallow cushion then you should look more at the New Balance Fresh Foam line (as revised) because they are softer and more &#34;cushy&#34; and also wonderful shoes for all distance running. I've been wearing my Rush all day on weekends and walking all over and doing some of my running (I rotate shoes to prevent injuries) and they have satisfied me in all conditions. I highly recommend them IF you are someone who likes a firmer shoe but with good rebound and energy, likes mid range drops (4-8MM), does not require a ton of stability or support, and just really likes a comfortable non confining shoe that is great for multi purpose!one hit will cause them all the flesh to pop out like those old biscuit packages! Stop buying shoes too small folks. Who cares what the size is. My size in these is 1 full size larger then many of my street shoes but about normal for me in running shoes. I wear a 6.5M or 6.5W and sometimes a 7M normally in flat's or heels. I bought these in 7.5M and they are just fine. If you have a foot that usually fits a M then just make sure you are sized appropriately. If your foot tends to run wider (but not so wide you always buy wide shoes) then make sure you go up at least a 1\/2 size...or buy the wide 1\/2 size longer. These are consistent with my other shoes for length but they are a bit pointy so take that into consideration.<br \/><br \/>If you are someone who wants cushy marshmallow cushion then you should look more at the New Balance Fresh Foam line (as revised) because they are softer and more &#34;cushy&#34; and also wonderful shoes for all distance running. I've been wearing my Rush all day on weekends and walking all over and doing some of my running (I rotate shoes to prevent injuries) and they have satisfied me in all conditions. I highly recommend them IF you are someone who likes a firmer shoe but with good rebound and energy, likes mid range drops (4-8MM), does not require a ton of stability or support, and just really likes a comfortable non confining shoe that is great for multi purpose!"}]