[{"text":"Update first!<br \/><br \/>I brought these to Burning Man this year.  Once I broke them out, I pretty much never wore anything else.  They wipe clean, they held up beautifully in the alkaline dust, and they looked great.  Everyone loved them.<br \/><br \/>I expected to need arch supports with them, but forgot to bring them.  My feet held up all right, though they were sometimes very sore at the end of the day.  I wouldn't want to wear these (or any other high-heeled shoe) on a daily basis year round, but for one week a year, they're fine.<br \/><br \/>On colder nights in the desert, I very much appreciated the extra width so I could wear extra-thick socks.  Walking was no problem even in uneven footing or pockets of deep dust.  Being 2&#34; taller than usual didn't hurt, either!  ;)<br \/><br \/>They also came in handy as part of the most ridiculous post-modern gladiator costume ever conceived, but that's neither here nor there.<br \/><br \/>I liked these so much that I think I'm going to order a second pair for clubbing.  I left my original pair in our camp's year-round storage so I won't have to schlep them back and forth to the desert.<br \/><br \/>BTW, for travel, wrapping the buckles in plastic wrap did the job beautifully.  I carried these shoes in my small carry-on bag along with a bunch of other random stuff, and they came through in perfect shape.<br \/><br \/>Back to the original review:<br \/><br \/>Full disclosure: I'm a guy, a dancer with the attendant high arches\/flexible feet going on, and not a regular wearer of high-heeled shoes, chunky or otherwise.  Thus, your mileage may vary significantly.<br \/><br \/>Onward!  I bought these to wear with costumes and so forth, and I've never really owned anything similar, so I don't have much direct basis for comparison in terms of comfort and so forth.  That said, I'll do my best.<br \/><br \/>Appearance and Materials:<br \/>These are simply really cute shoes.  They look quite a bit better than I expected them to, in fact.<br \/><br \/>The color of the plastic stuff the shoes are made from is quite a bit darker than you might guess based on the picture, but as another reviewer mentioned, that's actually a good thing -- the shoes look great, and the sparkly stuff (which is safely contained inside the plastic) really shines.<br \/><br \/>The buckles do, as often mentioned, seem pretty cheesy.  Considering that these shoes cost me fourteen bucks through Prime, I really can't complain about that.  A previous reviewer posted an effective fix; I plan to employ that if the buckles give up the ghost.  Also, if you're traveling with them packed, you might want to wrap some plastic wrap around the buckles to prevent them from snagging on things.<br \/><br \/>Be warned that the shoes might smell weird (mine did!) when they first arrive (ironically, mine are stamped &#34;Natural Breeze&#34; on the inside of the foot bed -- &#34;I do not think that word means what you think that it means...&#34;).  Let them breathe for a couple of days, and the smell will dissipate.<br \/><br \/>Fit, Comfort, and Arch Support (or Complete Lack Thereof):<br \/>I wear a European size 40 - 41, so I ordered a US 10, and the fore-aft fit is spot on.<br \/><br \/>I was also pleased with the width, which is pretty good (in addition to being weird, my feet are narrow).  I could use one more hole on the strap for barefoot wear or with really thin socks; with normal to thick socks, these would be about perfect.<br \/><br \/>I thought the plastic footbed would feel weird, but to be honest, I pretty much forgot about it after the first few minutes.  I wore these around my house for several hours the day they arrived, then again the next day; they definitely behave as you might expect plastic shoes to behave when you accidentally dump water in them, but they're really basically pretty comfortable.<br \/><br \/>That said, unless you have really flat feet, do not expect these shoes to come anywhere near your arches.  If you've got high arches, expectto feel contact at the heelbone and the balls of your feet and basically nowhere else.  It may wind up looking a bit odd, but I'm definitely going to wear these with arch supports in them.  I'd rather look a little weird than risk screwing up my feet.<br \/><br \/>As it stands, I can wear them fairly comfortably for a couple hours, then not terribly uncomfortably for a couple more, but eventually my feet start to hurt.  I have pretty strong feet, so that's probably worth noting, but the closest thing I've worn in terms of heel-to-toe ratio has been a pair Iron Age work wellingtons with pretty substantial heels.  That said, those were the most comfortable boots I ever owned, so that might also be worth noting.<br \/><br \/>Oh: walking in these is also no big deal.  I expected to feel like I was going to fall over and kill myself, especially going down the stairs, but I didn't feel that way at all.  Even if you tend, as I do, to a mid-foot stride, you'll probably be fine in these shoes.  Performance may vary on uneven surfaces, though.  I'll find out next week.<br \/><br \/>So there you have it.  Overall, I'm quite pleased with these shoes -- they look nice, seem pretty well-made, and aren't horribly uncomfortable.  Flimsy buckles and lack of arch support can be compensated for as needed.<br \/><br \/>I'll try to get a picture added ASAP, maybe with socks on so you don't have to look at my snaggly toenails.in them.  I'd rather look a little weird than risk screwing up my feet.  As it stands, I can wear them fairly comfortably for a couple hours, then not terribly uncomfortably for a couple more, but eventually my feet start to hurt.  I have pretty strong feet, so that's probably worth noting, but the closest thing I've worn in terms of heel-to-toe ratio has been a pair Iron Age work wellingtons with pretty substantial heels.  That said, those were the most comfortable boots I ever owned, so that might also be worth noting.  Oh: walking in these is also no big deal.  I expected to feel like I was going to fall over and kill myself, especially going down the stairs, but I didn't feel that way at all.  Even if you tend, as I do, to a mid-foot stride, you'll probably be fine in these shoes.  Performance may vary on uneven surfaces, though.  I'll find out next week.  So there you have it.  Overall, I'm quite pleased with these shoes -- they look nice, seem pretty well-made, and aren't horribly uncomfortable.  Flimsy buckles and lack of arch support can be compensated for as needed.  I'll try to get a picture added ASAP, maybe with socks on so you don't have to look at my snaggly toenails."}]